;初始化地址由cs连接的IOY端口决定, 0600为IOY0, 0640为IOY1

;-----------------------------------------------------------------------------------------
;8255初始化，cs连接IOY0

C8255_A equ 0600h
C8255_B equ 0602h
C8255_C equ 0604h
C8255_CON equ 0606h

init8255:
    mov dx, C8255_CON
    ;mov al, 10001001b ;AB出 C入
    ;mov al, 10001011b ;A出 BC入
    out dx, al

;-----------------------------------------------------------------------------------------
;8254初始化，cs连接IOY0, 产生一秒方波, GATE连接高电平开始计数

C8254_A equ 0600h
C8254_B equ 0602h 
C8254_C equ 0604h 
C8254_CON equ 0606h

init8254:
		mov dx, C8254_CON
		mov al, 01110110b   ;8254计数器1工作在方式3，产生方波。 
		out dx, al 
		mov dx, C8254_B
		mov al, 00h
		out dx, al 
		mov al, 048h        ;写入计数初值04800h 
		out dx, al 

;-----------------------------------------------------------------------------------------
; 设置中断向量，其中中断向量程序的标号为MIR6和MIR7
; 一个地址占两字节，中断向量格式为 段地址:偏移地址

set_IR6:	; MIR6中断向量的存放地址 003AH:0038H
    MOV AX,OFFSET MIR6
    MOV SI,0038H
    MOV [SI],AX ; 设置偏移地址
    MOV AX,CS
    MOV SI,003AH
    MOV [SI],AX ; 设置段地址

set_IR7:	; MIR7中断向量的存放地址 003EH:003CH
    MOV AX,OFFSET MIR7
    MOV SI,003CH
    MOV [SI],AX ; 设置偏移地址
    MOV AX,CS
    MOV SI,003EH
    MOV [SI],AX ; 设置段地址

;-----------------------------------------------------------------------------------------
; 0809初始化， A/D转换, cs连接IOY1

C0809_A equ 0640h
C0809_B equ 0642h

init0809:
    mov dx, C0809_B
    mov al, 00h
    out dx, al   ;启动0通道

start0809:
    mov dx, C0809_A
    mov al, 00h
    out dx, al   ;开启采样

get0809:
    mov dx, C0809_A
    in al ,dx    ;读取采样结果

;-----------------------------------------------------------------------------------------
; 使用示波器时， 0809cs接IOY3， ABC接XA1 XA2 XA3，D0-7接XD0-7


;-----------------------------------------------------------------------------------------
;延时程序
delay:
    push cx
    mov cx,0ffffh
    loop $
    mov cx,0ffffh
    loop $
    pop cx
    ret 
